FILES/DataProcessors/ПрикрепленныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ПрикрепленныеФайлы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Смета</v8:Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>md5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FILES/InformationRegisters/ФайлыДляОтправкиВОблако.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ФайлыДляОтправкиВОблако</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>md5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВложенныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/Enums/ТипыВложенныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыВложенныхФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Системный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/DataProcessors/ПрикрепленныеФайлы/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	// Вставить содержимое обработчика.
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = "";
	Диалог.ПредварительныйПросмотр = Истина;
	Диалог.Фильтр ="*.*"; // картинки


	Диалог.Показать(Новый ОписаниеОповещения("ПрикрепитьФайлЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог))); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		//Адрес = Строка(Новый УникальныйИдентификатор());
		ДД = Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла);
		Адрес = ПоместитьВоВременноеХранилище(ДД);
		ИнфоПоФайлу = Новый Файл(Диалог.ПолноеИмяФайла);
		
		УправлениеБТВызовСервера.ПоставитьВОчередьФайл(Объект.Объект, Адрес, ИнфоПоФайлу.Имя, ПредопределенноеЗначение("Перечисление.ТипыВложенныхФайлов.ЭлектронныйДокумент"));
		ЭтаФорма.Элементы.Файлы.Обновить();
	Иначе
		//Отказ = Истина;
	КонецЕсли;

КонецПроцедуры



&НаСервере
Процедура ОбъектПриИзмененииНаСервере()
	Файлы.Параметры.УстановитьЗначениеПараметра("Объект", Объект.Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	ОбъектПриИзмененииНаСервере();
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Параметры.Свойство("СсылкаНаОбъект", Объект.Объект);
	Файлы.Параметры.УстановитьЗначениеПараметра("Объект", Объект.Объект);

	Если ЗначениеЗаполнено(Объект.Объект) Тогда
		ЭтаФорма.Элементы.Объект.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры




&НаСервереБезКонтекста
Процедура УдалениеФайлаНаСервере(УдаляемаяMD5)
	 
	УправлениеБТВызовСервера.УдалитьФайлВОблаке(УдаляемаяMD5);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПослеУдаления(Элемент)
	УдалениеФайлаНаСервере(УдаляемаяMD5);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФайлыПередУдалениемНаСервере(ТекущаяСтрока)
	// Вставить содержимое обработчика.
	УдаляемаяMD5 = "";
	
	МЗ = РегистрыСведений.ФайлыДляОтправкиВОблако.СоздатьМенеджерЗаписи();
	МЗ.GUID = ТекущаяСтрока.GUID;
	МЗ.Объект = ТекущаяСтрока.Объект;
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		УдаляемаяMD5 = МЗ.md5;
	КонецЕсли;	

	Возврат УдаляемаяMD5;
КонецФункции

&НаКлиенте
Процедура ФайлыПередУдалением(Элемент, Отказ)
	УдаляемаяMD5 = ФайлыПередУдалениемНаСервере(Элемент.ТекущаяСтрока);
КонецПроцедуры



&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ФайлыТипВложения" Тогда
		СтандартнаяОбработка = Истина;
	ИначеЕсли СтрНайти(Элемент.ТекущиеДанные.ИмяФайла, ".file") Тогда
		
		Адрес = ФайлыВыборСервер(Элемент.ТекущаяСтрока);			
		Если ЗначениеЗаполнено(Адрес) Тогда 
			ДД = ПолучитьИзВременногоХранилища(Адрес);
			HttpБуфер = Новый HTTPЗапрос;
			HttpБуфер.УстановитьТелоИзДвоичныхДанных(ДД);
			СтрокаСодержимое = HttpБуфер.ПолучитьТелоКакСтроку();
			
			Если Элемент.ТекущиеДанные.ИмяФайла = "json.file" Тогда
				//
				СтруктураЖСОН = УправлениеБТВызовСервера.ИзJSON(СтрокаСодержимое);
				//ЧтениеJSON = Новый ЧтениеJSON; 
				//ЧтениеJSON.УстановитьСтроку(СтрокаСодержимое);
				//СтруктураЖСОН = ПрочитатьJSON(ЧтениеJSON);
				//ЧтениеJSON.Закрыть();
				
				СтрокаСодержимое = УправлениеБТВызовСервера.ВJSON(СтруктураЖСОН);
				//ЗапистьJSON = Новый ЗаписьJSON;
				//ЗапистьJSON.УстановитьСтроку();
				//ЗаписатьJSON( ЗапистьJSON, СтруктураЖСОН);
				//СтрокаСодержимое = ЗапистьJSON.Закрыть();				
			КонецЕсли;
			
			Текст = Новый ТекстовыйДокумент;
			Текст.УстановитьТекст(СтрокаСодержимое);
			Текст.Показать(Элемент.ТекущиеДанные.ИмяФайла);
		КонецЕсли;
			
	Иначе
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.Заголовок = "Укажите файл";
		Диалог.ПолноеИмяФайла = Элемент.ТекущиеДанные.ИмяФайла;
		Диалог.ПредварительныйПросмотр = Ложь;
		Диалог.Фильтр ="*.*"; // картинки

		Диалог.Показать(Новый ОписаниеОповещения("ФайлыВыборЗавершение", ЭтотОбъект, Новый Структура("Диалог, Элемент", Диалог, Элемент))); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыборЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	Элемент = ДополнительныеПараметры.Элемент;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		Адрес = ФайлыВыборСервер(Элемент.ТекущаяСтрока);			
		Если ЗначениеЗаполнено(Адрес) Тогда 
			ДД = ПолучитьИзВременногоХранилища(Адрес);
			ИнфоПоФайлу = Новый Файл(Диалог.ПолноеИмяФайла);
			ДД.Записать(Диалог.ПолноеИмяФайла);
		КонецЕсли;
		
	Иначе
		//Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФайлыВыборСервер(ТекущаяСтрока)
	
	Адрес = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФайлыДляОтправкиВОблако.Период,
	               |	ФайлыДляОтправкиВОблако.GUID,
	               |	ФайлыДляОтправкиВОблако.Объект,
	               |	ФайлыДляОтправкиВОблако.ИмяФайла,
	               |	ФайлыДляОтправкиВОблако.Отправлено,
	               |	ФайлыДляОтправкиВОблако.ДД,
	               |	ФайлыДляОтправкиВОблако.md5,
	               |	ФайлыДляОтправкиВОблако.ТипВложения
	               |ИЗ
	               |	РегистрСведений.ФайлыДляОтправкиВОблако КАК ФайлыДляОтправкиВОблако
	               |ГДЕ
	               |	ФайлыДляОтправкиВОблако.GUID = &GUID
	               |	И ФайлыДляОтправкиВОблако.Объект = &Объект";
	Запрос.УстановитьПараметр("GUID",ТекущаяСтрока.GUID);
	Запрос.УстановитьПараметр("Объект",ТекущаяСтрока.Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДД = УправлениеБТВызовСервера.ПолучитьФайлИзОблака(Выборка.md5);
		Адрес = ПоместитьВоВременноеХранилище(ДД);		
	КонецЕсли;

	//МЗ = РегистрыСведений.ФайлыДляОтправкиВОблако.СоздатьМенеджерЗаписи();
	//МЗ.GUID = СОкрЛП(ТекущаяСтрока.GUID);
	//МЗ.Объект = ТекущаяСтрока.Объект;
	//МЗ.Прочитать();
	//Если МЗ.Выбран() Тогда
	//	ДД = УправлениеБТВызовСервера.ПолучитьФайлИзОблака(МЗ.md5);
	//	Адрес = ПоместитьВоВременноеХранилище(ДД);
	//КонецЕсли;	
	
	Возврат Адрес;
	
КонецФункции





&НаКлиенте
Процедура ФайлыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Файл") Тогда
		ДД = Новый ДвоичныеДанные(ПараметрыПеретаскивания.Значение.ПолноеИмя);
		Адрес = ПоместитьВоВременноеХранилище(ДД);
		ИнфоПоФайлу = Новый Файл(ПараметрыПеретаскивания.Значение.ПолноеИмя);
		
		УправлениеБТВызовСервера.ПоставитьВОчередьФайл(Объект.Объект, Адрес, ИнфоПоФайлу.Имя, ПредопределенноеЗначение("Перечисление.ТипыВложенныхФайлов.ЭлектронныйДокумент"));
		ЭтаФорма.Элементы.Файлы.Обновить();
	КонецЕсли;
	
КонецПроцедуры
